<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 4, Labor 2: Cybersicherheit, Seite 5</title>
    </head>
    <body>
        <h2>Sicherheitsrisiken</h2>
        <div class="todo">So viel Text! Paul, kannst du K&uuml;rzungen vorschlagen? --MF, 05.08.2019</div>
        <div class="learn">
            <p><strong>Auf dieser Seite</strong> besch&auml;ftigst du dich mit Bedrohungen f&uuml;r die Online-Sicherheit.</p>
        </div>
        <p>Urspr&uuml;nglich spielte Netzwerksicherheit kaum eine Rolle, weil das Arpanet ein kleines Computernetz aus Milit&auml;rangeh&ouml;rigen und Hochschulbesch&auml;ftigten war. Der Bedarf an Sicherheit entstand erst, als Unternehmen 1995 ins Internet durften. Heute geben Menschen ihre Kreditkartendaten auf Shopping-Websites an, erledigen einen Gro&szlig;teil ihrer Bankgesch&auml;fte online und senden ihre Sozialversicherungsnummern an Steuerkanzleien und Auskunfteien. Und Computer, die kritische Infrastruktur steuern (z.&nbsp;B. Kraftwerke, Telefonvermittlungssysteme, Ampeln oder Krankenhausger&auml;te), k&ouml;nnen von Kriminellen oder fremden Milit&auml;rs angegriffen werden.</p>

        <h3>Typische Sicherheitsprobleme f&uuml;r Nutzende</h3>
        <div class="ap-standard">Designfehler: IOC-2.B.10, Anti-Virus und Anti-Malware: IOC-2.C.7, Phishing: IOC-2.C.1</div>
        <div class="vocabBig">: <strong>Malware</strong>, <strong>Keylogging-Software</strong>, <strong>Computervirus</strong>, <strong>Antivirus- oder Anti-Malware-Software</strong>, <strong>Firewall</strong> und <strong>Phishing</strong>
            <div class="ap-standard">Malware: IOC-2.B.9, Keylogging: IOC-2.C.2, Virus: IOC-2.B.8, Antivirus- oder Anti-Malware-Software: IOC-2.B.7, Phishing: IOC-2.C.1</div>
            <ul>
                <li><strong>Malware</strong> ist Software, die entwickelt wurde, um deinem Computer zu schaden oder teilweise die Kontrolle &uuml;ber ihn zu &uuml;bernehmen.</li>
                <li><strong>Keylogging-Software</strong> ist eine Art Malware, die jede Tastenanschlag einer Person protokolliert.</li>
                <li>Ein <strong>Computervirus</strong> ist eine Form von Malware, die sich verbreitet und andere Computer infiziert. Viren k&ouml;nnen sich an legitime Programme anh&auml;ngen.</li>
                <li><strong>Antivirus- oder Anti-Malware-Software</strong> durchsucht Dateien und Internet&uuml;bertragungen nach Malware.</li>
                <li>Eine <strong>Firewall</strong> ist ein Sicherheitssystem, das steuert, welche Verbindungen zwischen einem Computer oder Netzwerk und der Au&szlig;enwelt zul&auml;ssig sind.</li>
                <li><strong>Phishing</strong> ist ein h&auml;ufiger Angriff, bei dem das Opfer dazu verleitet wird, pers&ouml;nliche Informationen preiszugeben oder Malware herunterzuladen.</li>
            </ul>
        </div>
        <p>Software enth&auml;lt <em>Bugs</em> (selbst ver&ouml;ffentlichte Programme von Profis). Diese Schwachstellen k&ouml;nnen missbraucht werden, etwa um deinen Computer abst&uuml;rzen zu lassen oder <em>Keylogging-Software</em> zu installieren, die alles mitschreibt, was du tippst &ndash; inklusive Passw&ouml;rter und vertraulicher Informationen. Softwareentwickler*innen versuchen, Sicherheitsl&uuml;cken zu verhindern und zu schlie&szlig;en, sobald sie entdeckt werden, aber nicht alle stellen Fixes sofort bereit. (Und nicht alle Nutzer*innen installieren Updates immer direkt!)</p>
        <p>Programme, die deinem Computer schaden wollen, hei&szlig;en allgemein <em>Malware</em>. Dein Computer kann sich Malware einfangen, wenn du oder jemand anders unzuverl&auml;ssige Software herunterl&auml;dt (z.&nbsp;B. von Freeware- oder Shareware-Seiten; nicht alles dort ist schlecht, aber ohne Vorsicht kannst du dir trotzdem etwas Sch&auml;dliches installieren).</p>
        <p>Eine Form von Malware ist ein <em>Virus</em>. Computerviren vervielf&auml;ltigen sich (wie biologische Viren) und versuchen, sich &uuml;ber das Netzwerk auf andere Computer zu verbreiten. <em>Antivirus-Software</em> soll solche Angriffe verhindern. Au&szlig;erdem begrenzen <em>Firewalls</em> die ein- und ausgehenden Verbindungen eines Computers. (Sowohl dein Computer als auch dein Router betreiben wahrscheinlich Firewall-Software.)</p>
        <p>Ein weiterer verbreiteter Angriff hei&szlig;t <em>Phishing</em>: Angreifende schicken dir eine E-Mail, die nach einer offiziellen Organisation (wie deiner Bank) aussieht, und locken dich dazu, Informationen preiszugeben (z.&nbsp;B. dein Bankpasswort). Diese Daten k&ouml;nnen sie dann nutzen, um auf sensible Online-Dienste wie Konten oder E-Mails zuzugreifen.</p>

        <div class="forYouToDo">
			<ol>
				<div class="ap-standard">IOC-2.C</div>
                <li><img class="inline" src="/bjc-r/img/icons/write-out-thoughts.png" alt="Schreibe deine Gedanken auf" title="Schreibe deine Gedanken auf" />Beschreibe drei Wege, wie jemand unbefugten Zugriff auf deinen Computer oder deine Daten erhalten k&ouml;nnte.</li>
				<div class="ap-standard">IOC-2.B</div>
				<li>Schilder ein Beispiel f&uuml;r ein Sicherheitsproblem, das du selbst oder jemand aus deinem Umfeld erlebt hat oder erleben k&ouml;nnte.</li>
			</ol>
		</div>

        <h3>Typische Sicherheitsprobleme &ouml;ffentlicher Systeme</h3>
        <p>Bei einem Denial-of-Service-(DoS)-Angriff werden viele Anfragen gleichzeitig an einen Server gesendet (z.&nbsp;B. Anfragen nach einer Webseite oder Daten). Dadurch kann die Netzwerkbandbreite des Servers &uuml;berlastet werden. Ein DoS-Angriff zerst&ouml;rt keine Daten und sammelt keine Passw&ouml;rter, sondern sorgt f&uuml;r eine vor&uuml;bergehende Nichterreichbarkeit des angegriffenen Servers, sodass andere Nutzer*innen keinen Service erhalten.</p>
        <div class="vocabBig">: <strong>DDoS (Distributed Denial of Service)-Angriff</strong>
        	<p>Ein <strong>DDoS-Angriff</strong> (Distributed Denial of Service) nutzt einen Virus, um einen Server gleichzeitig mit vielen Anfragen von zahlreichen Computern zu &uuml;berfluten, sodass Nutzende keinen Service erhalten.</p>
        </div>
        <p>Eine Variante ist der <em>Distributed Denial of Service</em> (DDoS). Dabei bringt der Angreifer zun&auml;chst mithilfe von Viren und anderer Malware viele Computer weltweit (manchmal hunderttausende) unter seine Kontrolle. Dieses Netzwerk infizierter Rechner hei&szlig;t <em>Botnetz</em>. Anschlie&szlig;end startet er von allen Opferrechnern gleichzeitig einen DoS-Angriff. Neben der gro&szlig;en Anzahl gleichzeitiger Anfragen erschwert DDoS auch die Identifikation der eigentlichen T&auml;ter*innen, weil der Angriff scheinbar von vielen unbeteiligten Personen ausgeht.</p>

        <div class="ap-standard">Rogue Access Point: IOC-2.C.3, IOC-2.C.4</div>
        <p>Wenn deine Daten nicht verschl&uuml;sselt sind, k&ouml;nnen sie auf &ouml;ffentlichen Netzwerken gelesen oder ver&auml;ndert werden. Eine M&ouml;glichkeit daf&uuml;r ist ein <em>Rogue Access Point</em>.</p>
		<div class="vocabFullWidth">: <strong>Rogue Access Point</strong>
			<p>Ein <strong>Rogue Access Point</strong> ist ein drahtloser Zugangspunkt, der ohne Zustimmung der Netzwerkadministration Zugang zu einem gesch&uuml;tzten Netzwerk verschafft.</p>
		</div>
        <p>Ein Rogue Access Point kann von jemandem eingerichtet werden, der den Zugang verbessern will, oder von Angreifenden. In jedem Fall kann fehlende Sicherheit dazu f&uuml;hren, dass Daten, die &uuml;ber dieses WLAN gesendet werden, abgefangen werden. Wenn dein Computer zum Beispiel Passwortzugriff auf ein WLAN hat und du Bluetooth-Netzwerkfreigabe aktivierst, erm&ouml;glichst du allen Personen im Bluetooth-Bereich deines Computers den Zugriff auf das gesch&uuml;tzte Netzwerk.</p>

        <h3>Kann es zu viel Sicherheit geben?</h3>
        <p>Zu viel Sicherheit bringt eigene Probleme mit sich. Ein vollkommen sicheres Internet w&uuml;rde anonyme Ver&ouml;ffentlichungen verhindern und damit die Meinungsfreiheit einschr&auml;nken. Um Betrug zu verhindern, muss sich die Quelle einer Nachricht &uuml;berpr&uuml;fen lassen; wenn das aber m&ouml;glich ist, kann eine Nachricht nicht anonym bleiben. Das ist sowohl f&uuml;r die Privatsph&auml;re als auch f&uuml;r die Meinungsfreiheit problematisch.</p>

        <div class="forYouToDo">
			<ol start="3">
				<li>
                	Diese Frage ist &auml;hnlich wie Fragen im AP-CSP-Examen.
                    <div class="assessment-data" type="multiplechoice" identifier="Which of the following are existing vulnerabilities of the Internet, according to experts?" hasinlinefeedback="true" maxchoices="3" responseIdentifier="ri1" shuffle="false">
                        <div class="prompt">Welche der folgenden Punkte gelten laut Expert*innen als bestehende Schwachstellen des Internets?</div>
                        <div class="choice" identifier="c1">
                            <div class="text">Ein physischer Angriff, bei dem Glasfaserkabel durchtrennt werden.</div>
                            <div class="feedback">Ja &ndash; aber vielleicht gibt es noch mehr!</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Angriffe auf elektrische Systeme, die das Stromnetz steuern.</div>
                            <div class="feedback">Ja &ndash; aber vielleicht gibt es noch mehr!</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Das Vertrauen der Bev&ouml;lkerung in Online-Privatsph&auml;re und sichere Transaktionen untergraben.</div>
                            <div class="feedback">Ja &ndash; aber vielleicht gibt es noch mehr!</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c1"></div>
                            <div class="correctResponse" identifier="c2"></div>
                            <div class="correctResponse" identifier="c3"></div>
                        </div>
                    </div>
                </li>
			</ol>
		</div>


    </body>
</html>
