<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 4, Labor 2: Cybersicherheit, Seite 6</title>
    </head>
    <body>
        <h2>Was kannst du tun?</h2>
        <div class="learn">
            <p><strong>Auf dieser Seite</strong> erf&auml;hrst du, wie du deine Daten und deinen Computer sch&uuml;tzen kannst.</p>
        </div>

        <p>
            Eigentlich sollte es nicht deine Aufgabe sein, deine Sicherheit im Netz allein sicherzustellen &ndash; so wenig, wie du jeden U-Bahn-Wagen vor dem Einsteigen selbst pr&uuml;fen musst. Ohne geeignete Regulierung gibt es keine perfekte L&ouml;sung, mit der du garantiert nie zum Opfer wirst. Aber einige Ma&szlig;nahmen helfen dir weiter:
            <ol>
         	<div class="sideHOM">
             	<div class="todo">IOC-2.B.2</div>
                <p>Ein <strong>starkes Passwort</strong> ist schwer zu erraten.</p>
            </div>

			<div class="atwork">
				<div class="imageRight">
					<img class="noshadow" height="200px" src="/bjc-r/img/atwork/Nicola_Whiting.jpg" alt="Foto von Nicola Whiting" title="Foto von Nicola Whiting" />
					<div class="endnote" style="width:244px;margin:6px;"><small>Bild mit Genehmigung von Nicola Whiting zur Ver&ouml;ffentlichung bereitgestellt</a></small></div>
				</div>
				<p>Nicola Whiting MBE ist eine preisgekr&ouml;nte Schmuckdesignerin und Autorin, die zur Cybersicherheits-Expertin wurde. Sie ist Mitinhaberin der Titania Group und hat das Unternehmen von einem Start-up mit drei Personen zu einem weltweit f&uuml;hrenden Anbieter f&uuml;r Tools entwickelt, die Netzwerksicherheit und Compliance-Probleme erkennen. Whiting sitzt in mehreren Gremien, die sich f&uuml;r mehr Vielfalt in der Cybersicherheit einsetzen, um Gruppendenken zu reduzieren und Innovation sowie organisatorische Resilienz zu f&ouml;rdern. Sie ist beispielsweise Sprecherin von NeuroCyber, einer Organisation, die sicherstellen m&ouml;chte, dass neurodivergente Menschen (die Informationen aufgrund von Unterschieden wie Autismus, ADHS, Legasthenie usw. anders verarbeiten) erfolgreich sein k&ouml;nnen &ndash; indem &bdquo;Inklusion per Design&ldquo; in Unternehmenskultur, Richtlinien und Praxis verankert wird.</p>
				<p><a href="https://nicolawhiting.com/all-the-voices-at-the-table/" title="Artikel von Nicola Whiting: All the Voices at the Table: the Benefits of Diversity" target="_blank">Artikel von Nicola Whiting: All the Voices at the Table: the Benefits of Diversity</a></p>
			</div>

                <div class="comment">Designfehler: IOC-2.B.10, Authentifizierungsma&szlig;nahmen: IOC-2.B.1, starke Passw&ouml;rter: IOC-2.B.2, Mehrfaktor-Authentifizierung: IOC-2.B.3, IOC-2.B.4, b&ouml;sartige Links: IOC-2.C.5, IOC-2.C.6, Sicherheitseinstellungen: IOC-2.B.11</div>
                <li><strong>Verwende aktuelle Software.</strong> Das Betriebssystem Windows 98 wurde nach 2000 nicht mehr verkauft und nach 2006 nicht mehr unterst&uuml;tzt. Trotzdem laufen <em>immer noch</em> Computer damit, darunter viele im US-Verteidigungsministerium.<a href="https://windowsreport.com/windows-95-98-pentagon/" target="_blank">[Quelle]</a> Oft bleiben Menschen bei veralteten Systemen, weil wichtige Anwendungen nur dort funktionieren.</li>
                <li>
                    Verwende Authentifizierung, um Ger&auml;te und Informationen vor unbefugtem Zugriff zu sch&uuml;tzen. Zum Beispiel:
                    <ol>
                        <li><strong>Nutze starke Passw&ouml;rter.</strong> Du brauchst f&uuml;r jede Website ein eigenes Passwort. Die beste L&ouml;sung ist ein <em>Passwortmanager</em>, der f&uuml;r jede Seite ein zuf&auml;lliges Passwort erstellt. Du merkst dir nur ein Passwort &ndash; das f&uuml;r den Passwortmanager &ndash;, und er verwaltet den Rest.</li>
                        <li><strong>Aktiviere Mehrfaktor-Authentifizierung</strong> (z.&nbsp;B. Zwei-Faktor-Authentifizierung), sodass du nur nach Eingabe bestimmter Informationen Zugriff erh&auml;ltst (typischerweise ein Passwort plus etwas, das ein weiteres Ger&auml;t oder Konto nutzt, oder etwas, das deinen K&ouml;rper erkennt wie ein Fingerabdrucksensor). Es mag aufwendig erscheinen, aber jeder zus&auml;tzliche Schritt erh&ouml;ht die Sicherheit.</li>
                    </ol>
                </li>
                <li><strong>Klicke keine Links</strong> auf Websites &ndash; und besonders nicht in E-Mails &ndash;, <strong>ohne vorher zu pr&uuml;fen</strong>, ob die URL tats&auml;chlich das ist, was du erwartest. (Wohin f&uuml;hrt dieser Link <a href="http://bjc.berkeley.edu" target="_blank">http://google.com</a> wirklich?) Wenn das Konto einer bekannten Person kompromittiert wurde, kannst du E-Mails erhalten, die scheinbar von ihr stammen, aber sch&auml;dliche Links enthalten. Updates sind wichtig, doch ein Trick besteht aus Pop-up-Fenstern, die dir scheinbare Updates anbieten. Klicke sie nur, wenn du sicher bist, dass sie legitim sind. Am besten suchst du Updates direkt im Update-Bereich der App oder des Betriebssystems.</li>
                <li><strong>Vermeide fragw&uuml;rdige Software.</strong> Wenn ein Programm Geld, kostenlose Dinge, Pornografie oder Cheats f&uuml;r Spiele verspricht, handelt es sich sehr wahrscheinlich um Malware. Besonders hinterlistig sind falsche Antivirus-Programme! Lies Rezensionen (und pr&uuml;fe den Download-Link), damit du wirklich das erh&auml;ltst, was du willst.</li>
                <li><strong>Pr&uuml;fe regelm&auml;&szlig;ig deine Sicherheitseinstellungen</strong> f&uuml;r Websites, Apps und Programme. Dort kannst du steuern, welche Berechtigungen zum Sammeln und Teilen deiner Informationen vergeben sind.</li>
                <li><strong>Installiere Antivirus- und Anti-Malware-Software.</strong> Es gibt kostenlose Versionen mehrerer g&auml;ngiger Pakete. Lies Tests, um Software zu finden, die zu deinen Anforderungen und deinem Budget passt.</li>
                <li><strong>Verbinde dich nicht mit unsicheren WLANs.</strong> Idealerweise sollten WLANs WPA2 oder WPA3 (WiFi Protected Access) verwenden, aber selbst WPA ist besser als gar keine Sicherheit.</li>
            </ol>
        </p>

        <div class="forYouToDo" id="first">
			<ol>
				<div class="ap-standard">IOC-2.B</div>
                <li>
                    <img class="inline" src="/bjc-r/img/icons/talk-with-your-partner-mini.png" alt="Sprich mit deiner Partnerin oder deinem Partner" title="Sprich mit deiner Partnerin oder deinem Partner" />
                    <img class="inline" src="/bjc-r/img/icons/write-out-thoughts.png" alt="Schreibe deine Gedanken auf" title="Schreibe deine Gedanken auf" />
                    Welche Sicherheitsrisiken bestehen f&uuml;r deine Ger&auml;te und wie kannst du dich dagegen sch&uuml;tzen?
                </li>
            </ol>
        </div>


    </body>
</html>
