<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 1, Labor 1: Click-Alonzo-Spiel, Seite 3</title>
	</head>

	<body>
		<h2>Dein Spiel teilen</h2>
		<div class="learn">Das Spiel ist noch lange nicht fertig, aber es ist <em>ausreichend</em> fertig. <strong>Auf dieser Seite</strong> teilst du dein Projekt, damit andere dein Spiel spielen k&ouml;nnen.</div>
		<div class="forYouToDo">
			<ol>

				<li>Wenn du ein Snap<em>!</em>-Konto hast, kannst du eine der folgenden Optionen nutzen. Ohne Snap<em>!</em>-Konto musst du Option&nbsp;A verwenden.

				<div class="narrower">
					<h3 class="box-head">Option A: Projekt als Datei teilen</h3>
					<div class="endnote">
						<a href="#hint-share-file" data-toggle="collapse" title="Wenn du eine XML-Datei verschickst, erhalten andere eine feste Version deines Projekts.">Wenn du eine XML-Datei verschickst, erhalten andere eine feste Version deines Projekts.</a>
						<div id="hint-share-file" class="collapse">
							<ul>
								<li>Auf der vorherigen Seite hast du gelernt, wie du eine XML-Datei speicherst, indem du auf deinen Computer statt in die Cloud speicherst. Du kannst auch das Datei-Men&uuml; (<img src="/bjc-r/img/1-introduction/file_button.png" alt="Datei-Men&uuml;-Button" title="Datei-Men&uuml;-Button"/>) &ouml;ffnen und &bdquo;Export project...&ldquo; w&auml;hlen, um eine XML-Datei zu erzeugen.</li>
								<li>Du kannst diese XML-Datei an andere schicken. Um sie zu &ouml;ffnen, k&ouml;nnen sie Snap<em>!</em> starten und die XML-Datei hineinziehen. Alternativ k&ouml;nnen sie im Datei-Men&uuml; (<img src="/bjc-r/img/1-introduction/file_button.png" alt="Datei-Men&uuml;-Button" title="Datei-Men&uuml;-Button"/>) &bdquo;Open...&ldquo; w&auml;hlen und die Datei &ouml;ffnen.</li>
								<li>Wenn du dein Projekt &auml;nderst, musst du es erneut speichern und die neue Datei verschicken, damit andere deine Aktualisierungen sehen.</li>
							</ul>
						</div>
					</div>

					<h3 class="box-head">Option B: Projekt als Link teilen</h3>
					<div class="endnote">
						<p><a href="#hint-share-link" data-toggle="collapse" title="Durch das &sbquo;Teilen&lsquo; deines Projekts entsteht ein Link, der anderen die zuletzt gespeicherte Version anzeigt.">&bdquo;Teilst&ldquo; du dein Projekt, entsteht ein Link, &uuml;ber den andere die zuletzt gespeicherte Version sehen k&ouml;nnen.</a></p>
						<div id="hint-share-link" class="collapse">
							<h4 class="box-head">Einen Link erstellen</h4>
							<img class="imageRight" src="/bjc-r/img/1-introduction/U1ImageVideoAddendum_img/U1L1P7_OpenFile.png"  height="350" alt="Dialog &sbquo;Open Project&lsquo;" title="Dialog &sbquo;Open Project&lsquo;"/>
							<ol type="a">
								<li>Stelle sicher, dass dein Projekt gespeichert ist.</li>
								<li>W&auml;hle im Snap<em>!</em>-Datei-Men&uuml; (<img src="/bjc-r/img/1-introduction/file_button.png" alt="Datei-Men&uuml;-Button" title="Datei-Men&uuml;-Button"/>) die Option &bdquo;Open...&ldquo;.</li>
								<li>
									W&auml;hle das Projekt aus der Liste, das du teilen m&ouml;chtest (dein aktuelles Projekt hei&szlig;t vermutlich &bdquo;U1L1-ClickAlonzo&ldquo;).
									<ul>
										<li>Um eine Datei zu finden, kannst du im Suchfeld oben tippen und dir alle passenden Dateien anzeigen lassen (im Beispiel rechts werden nur Dateien angezeigt, die mit &bdquo;U1&ldquo; beginnen).</li>
									</ul>
								</li>
								<li>Klicke auf &bdquo;Share&ldquo; und dann auf &bdquo;Yes&ldquo;, um zu teilen. Klicke danach auf &bdquo;Cancel&ldquo;, um das Men&uuml; zu schlie&szlig;en.</li>
								<li>
									Jetzt hat sich die URL (der Link) oben im Browserfenster ge&auml;ndert. Kopiere die neue URL und schicke sie an jemand anderen, um das Projekt zu teilen.
									<ul>
										<li>
											<a href="#hint-URL" data-toggle="collapse" title="Klicke hier f&uuml;r Abbildungen, wo die URL steht und wie sie sich &auml;ndert.">Klicke hier f&uuml;r Abbildungen, wo die URL steht und wie sie sich &auml;ndert.</a>
											<div id="hint-URL" class="collapse">
												<img class="inline" src="/bjc-r/img/1-introduction/url-before.png" width="800" alt="Snap!-Fenster mit URL &sbquo;snap.berkeley.edu/snapsource/snap.html&lsquo;, markiert als &sbquo;URL before sharing&lsquo;" title="URL vor dem Teilen" /><br />
												<img class="inline" src="/bjc-r/img/1-introduction/url-after.png" width="800" alt="Snap!-Fenster mit URL &sbquo;snap.berkeley.edu/snapsource/snap.html#present:Username=bh&Proje...&lsquo;, markiert als &sbquo;URL after sharing&lsquo;" title="URL nach dem Teilen" />
											</div>
										</li>
									</ul>
								<p>Wenn du dein Projekt nach dem Teilen speicherst, werden die &Auml;nderungen unter der bereits geteilten URL sichtbar. (Die andere Person muss die Seite eventuell neu laden.) Du musst den Link nicht erneut teilen.</p>
                                </li>
							</ol>
						</div>
					</div>
				</div>
                </li>
				<li>
					Wenn du mit einer Partnerin oder einem Partner arbeitest, stellt sicher, dass ihr beide eine Kopie habt.
					<div class="narrower">
						<h3 class="box-head">Eine Kopie eines Projekts speichern</h3>
						<ul>
							<li>Ganz gleich, ob ihr euer Projekt als Datei oder als Link teilt: Sobald die zweite Person das Projekt speichert (auf ihrem Computer oder in ihrem Konto), speichert sie eine <em>Kopie</em>&mdash;nicht dieselbe gemeinsame Datei. Wenn die zweite Person etwas &auml;ndert, muss sie das Projekt erneut speichern und (als Datei oder Link) teilen, damit die erste Person die &Auml;nderung sieht.
                                <div class="endnote">Wenn ihr beide Snap<em>!</em>-Konten habt, wird das Projekt im Konto der Person gespeichert, die aktuell angemeldet ist. Um zu wechseln, wer in Snap<em>!</em> angemeldet ist, &ouml;ffne das Cloud-Men&uuml; (<img src="/bjc-r/img/1-introduction/cloud_button.png" alt="Cloud-Men&uuml;-Button">) und w&auml;hle &bdquo;Logout&ldquo;. Lass deine Partnerin oder deinen Partner sich bei Snap<em>!</em> anmelden. </div>
                            </li>
						</ul>
					</div>
				</li>
			</ol>
		</div>

	</body>
</html>
