<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 1, Labor 1: Click-Alonzo-Spiel, Seite 5</title>
	</head>

	<body>
        <h2>Dein Spiel verbessern</h2>
        <div class="learn">
            Es gibt immer etwas, das ein Programm besser macht. <strong>Auf dieser Seite</strong> verbesserst du dein Spiel, indem Alonzo die Spielerinnen und Spieler begr&uuml;&szlig;t, sobald auf die gr&uuml;ne Flagge (<img src="/bjc-r/img/1-introduction/green-flag_button.png" alt="gr&uuml;ner Flaggen-Button" title="gr&uuml;ner Flaggen-Button"/>) geklickt wird.
        </div>
        <div class="forYouToDo" id="first">
    		<ol>
                <li>Wenn dein Projekt noch ge&ouml;ffnet ist und das Skript l&auml;uft, klicke auf das rote Stoppschild, <img src="/bjc-r/img/1-introduction/stop_button.png" alt="roter Stopp-Button" title="roter Stopp-Button"/>. Falls es nicht ge&ouml;ffnet ist, lade dein Projekt U1L1-ClickAlonzo.</li>
            </ol>
        </div>
        <p>
            Ein Klick auf den Flaggen-Button oben rechts im Fenster (<img src="/bjc-r/img/1-introduction/green-flag_button.png" alt="gr&uuml;ner Flaggen-Button" title="gr&uuml;ner Flaggen-Button"/>) startet alle Skripte, die mit dem Hutblock <code>when green flag clicked</code> beginnen.<br />
            <img class="indent" src="/bjc-r/img/blocks/when-green-flag-clicked-full-size.png" alt="gelber Hutblock mit der Aufschrift When 'Bild einer gr&uuml;nen Flagge' clicked" title="gelber Hutblock &sbquo;when green flag clicked&lsquo;"/>
        </p>
        <div class="forYouToDo">
            <ol start="2">
                <li>
                    Erstelle ein zweites Skript, das Alonzo ein Begr&uuml;&szlig;ungstext <img src="/bjc-r/img/blocks/say-empty.png" alt="say ()" title="say ()" /> sprechen l&auml;sst, wenn die gr&uuml;ne Flagge angeklickt wird. (Alonzo k&ouml;nnte sagen: &bdquo;Willkommen bei &sbquo;Click Alonzo!&lsquo; Klick mich weiter an, wenn du kannst!&ldquo;)
                 </li>
                <li>
                    Sorge daf&uuml;r, dass die Nachricht verschwindet, sobald Alonzo angeklickt wird.
                    <div class="endnote">Ein <code>say</code>-Block mit leerem Text im wei&szlig;en <em><strong>Eingabefeld</strong></em> sorgt daf&uuml;r, dass der Sprite nichts sagt.</div>
                </li>
                <li>
                    &Uuml;berpr&uuml;fe, ob deine App alles tut, was du erwartest:
                    <ul>
                        <li>Wenn die gr&uuml;ne Flagge angeklickt wird, soll Alonzo die Spielerin oder den Spieler begr&uuml;&szlig;en.</li>
                        <li>Wenn Alonzo angeklickt wird, soll die Nachricht verschwinden, Alonzo soll an eine zuf&auml;llige Stelle springen, sich umdrehen und transparenter werden.</li>
                        <li>Wenn Alonzo sich bewegt, ohne angeklickt zu werden, soll er wieder sichtbar werden (aber sich nicht umdrehen).</li>
                    </ul>
                </li>
                <li><img class="inline" src="/bjc-r/img/icons/save-now.png" alt="Speichere deine Arbeit" title="Speichere deine Arbeit" /></li>
 			</ol>
		</div>


	</body>
</html>
