<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 1, Labor 2: Tratsch, Seite 1</title>
	</head>

	<body>
		<h2>Paarprogrammierung</h2>

        <div class="learn">
            <p><strong>Auf dieser Seite</strong> lernst du, wie Zusammenarbeit mithilfe von Paarprogrammierung funktioniert.</p>
        </div>

		<p>In den Anfangsjahren der Computer programmierte man allein. Man plante das Programm im Kopf und setzte sich dann hin, um den Code zu schreiben.</p>
		<p>Die Programme von heute sind daf&uuml;r viel zu komplex. Grafische Benutzeroberfl&auml;chen, Kommunikation mit Servern im Internet, Internationalisierung, Schutz vor Malware und viele weitere Anforderungen geh&ouml;ren zu professionellen Softwareprojekten, und an einem Programm arbeiten oft <em>Hunderte</em> Autorinnen und Autoren.</p>
		<p>Deshalb sind <em>Kooperationsf&auml;higkeiten</em> heute genauso wichtig wie Programmierf&auml;higkeiten. Selbst wenn du nicht als Programmierer*in arbeitest, geh&ouml;rt Zusammenarbeit in den meisten Berufen dazu.</p>
        <div class="ap-standard">CRD-1.B.2</div>
        <p>Es gibt mehrere Arten, eine Zusammenarbeit zu organisieren. In diesem Kurs verwendest du eine Technik namens <a href="http://en.wikipedia.org/wiki/Pair_programming" title="Wikipedia: Pair programming" target="_blank"><em>Paarprogrammierung</em></a>&mdash;Computerprogramme zu zweit schreiben. Eine Person, die <em>Driver</em>, steuert den Computer. Die andere Person, die <em>Navigatorin</em> oder der <em>Navigator</em>, hilft, Fehler zu finden und darauf zu achten, dass der entstehende Code zum Gesamtplan passt. Die Navigatorin bzw. der Navigator liest au&szlig;erdem die Lab-Seiten laut vor. Wechselt euch etwa alle f&uuml;nf Minuten ab, damit ihr beide jede Rolle gleich viel &uuml;bt.</p>

		<div class="takeNote">
			<h3 class="box-head">Wie Paarprogrammierung <em>nicht</em> funktioniert:</h3>
			<p>Der gr&ouml;&szlig;te Fehler bei der Paarprogrammierung ist, wenn die Navigator-Rolle abschaltet und der Driver alles alleine macht. Die Navigatorin bzw. der Navigator muss aufmerksam bleiben; sonst macht ihr der Reihe nach die gesamte Arbeit, statt von zwei Personen zu profitieren.</p>
		</div>

        <h4>So arbeitet ihr im Team bei der Paarprogrammierung</h4>
        <div class="ap-standard">
            CRD-1.C.1:
            <ul>
                <li>Kommunikation &ndash; Redet weiter, H&ouml;rt zu</li>
                <li>Konsensbildung &ndash; Nicht feilschen</li>
                <li>Konfliktl&ouml;sung &ndash; Nicht defensiv werden, Keine Angst vor Konflikten</li>
                <li>Verhandeln &ndash; Nicht feilschen</li>
            </ul>
        </div>
        <p>
            <ul>
                <li><strong>Bleibt im Gespr&auml;ch.</strong> Der Driver sollte st&auml;ndig erkl&auml;ren, warum er oder sie genau diesen Block benutzt. Die Navigatorin sollte nachfragen: Ginge es auch anders? Wie verhindern wir diesen oder jenen Fehler? M&uuml;ssen wir nicht gleich mehrere Anforderungen auf einmal ber&uuml;cksichtigen? Wir wiederholen hier fast denselben Code wie an einer anderen Stelle; k&ouml;nnten wir diesen Code in einen Block packen und den Block an beiden Stellen nutzen? Und so weiter.</li>
                <li><strong>H&ouml;rt zu.</strong> Versucht, die Gedanken eurer Partnerin bzw. eures Partners zu verstehen, bevor ihr widersprecht.</li>
                <li><strong>Arbeitet als Team.</strong> Wenn du dich gegen R&uuml;ckmeldungen verteidigst, denk daran, dass niemand von Anfang an perfekten Code schreibt. Es ist die Aufgabe der Navigatorin, Probleme im Code des Drivers zu finden, und beim Rollenwechsel revanchiert sich der neue Navigator. Ihr seid ein Team, kein Wettbewerb.</li>
                <li><strong>Findet gemeinsamen Konsens.</strong> Feilscht nicht. Wenn ihr euch nicht einig seid, sagt nicht &bdquo;Du darfst das so machen, wenn ich daf&uuml;r etwas anderes so machen darf.&ldquo; H&ouml;rt auf die <em>Gr&uuml;nde</em> der anderen Person und sucht gemeinsam nach einer L&ouml;sung, die beiden gerecht wird.</li>
                <li><strong>Sprecht offen und kl&auml;rt Differenzen.</strong> Das hei&szlig;t nicht, dass ihr absichtlich Streit suchen sollt. Aber wenn ihr euch uneinig seid, k&ouml;nnt ihr trotzdem befreundet bleiben. L&ouml;st den Konflikt, indem ihr zuh&ouml;rt und euch gegenseitig versteht, statt nur nachzugeben, um die Diskussion zu beenden.</li>
                <li><strong>Unabh&auml;ngig von der Erfahrung: Abwechseln.</strong> Lasst nicht zu, dass die erfahrenere Person die andere &uuml;berrollt. Achtet darauf, dass sich beide in beiden Rollen wohl f&uuml;hlen. Eine Gruppe l&ouml;st Probleme fast immer besser als eine einzelne Person.</li>
            </ul>
        </p>

        <p>
            In der ersten Einheit erinnern euch diese Symbole daran, an bestimmten Stellen im Labor die Rollen zu wechseln. Danach seid ihr selbst daf&uuml;r verantwortlich, ungef&auml;hr alle f&uuml;nf Minuten zu tauschen.<br />
            <img class="indent" src="/bjc-r/img/icons/pair-programming-swap.png" alt="Paarprogrammierung: Wechsel" title="Paarprogrammierung: Wechsel">
            <img class="indent" src="/bjc-r/img/icons/pair-programming-swap-mini.png" alt="Paarprogrammierung: Wechsel" title="Paarprogrammierung: Wechsel">
		</p>

		<div class="forYouToDo">
			<div class="ap-standard">CRD-1.C</div>
			<ol>
				<li>Deine Lehrkraft teilt die Anleitung f&uuml;r das Spiel &bdquo;Lost on the Moon&ldquo; aus.</li>
			</ol>
        </div>


    </body>
</html>
