<!doctype html>
<html lang="de">
    <head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 4, Labor 1: Computernetzwerke, Seite 1</title>
    </head>

	<body>
        <h2>Was ist das Internet?</h2>
        <div class="todo">
			Erw&auml;ge, das BTB-Material wieder aufzunehmen:
			<li>
                	Auf mehreren Seiten dieses Labors empfehlen wir im Abschnitt &bdquo;Wenn noch Zeit ist&ldquo; eine kurze Lekt&uuml;re aus dem <a href="http://www.bitsbook.com/wp-content/uploads/2008/12/B2B_3.pdf#page=319" target="_blank" title="APPENDIX The Internet as System and Spirit"><em>Blown to Bits</em>-Anhang</a>:
                    <ul>
                        <li>Seite 1: Adressen in einem Netzwerk aus Netzwerken: IP. <a href="http://www.bitsbook.com/wp-content/uploads/2008/12/B2B_3.pdf#page=319" target="_blank" title="Blown to Bits pages 301-306"><em>Blown to Bits</em>, Seiten 301&ndash;306</a>.</li>
                        <li>Seite 2: Zuverl&auml;ssige &Uuml;bertragung in unzuverl&auml;ssigen Netzwerken: TCP. <a href="http://www.bitsbook.com/wp-content/uploads/2008/12/B2B_3.pdf#page=324" target="_blank" title="Blown to Bits pages 306-309"><em>Blown to Bits</em>, Seiten 306&ndash;309</a>.</li>
                        <li>Seite 3: Eine Hierarchie offener Protokolle. <a href="http://www.bitsbook.com/wp-content/uploads/2008/12/B2B_3.pdf#page=327" target="_blank" title="Blown to Bits pages 309-312"><em>Blown to Bits</em>, Seiten 309&ndash;312</a>.</li>
                        <li>Seite 4: Wer hat im Internet das Sagen? <a href="http://www.bitsbook.com/wp-content/uploads/2008/12/B2B_3.pdf#page=330" target="_blank" title="Blown to Bits pages 312-316"><em>Blown to Bits</em>, Seiten 312&ndash;316</a>. Ideal ist es, wenn diese Aufgabe vor der Unterrichtsstunde gelesen wird, in der die entsprechende Laborseite behandelt wird.
                        </li>
                    </ul>
                </li>
		</div>
		<div class="learn">
            <p><strong>In diesem Labor</strong> lernst du, wie das Internet funktioniert.</p>
            <p><strong>Auf dieser Seite</strong> erf&auml;hrst du die Grundlagen dessen, was das Internet ist, was an seiner Funktionsweise am wichtigsten ist und was es bedeutet, Informationen &bdquo;in der Cloud&ldquo; zu speichern.</p>
        </div>

        <div class="commentBig">CSN-1.B.1 (minus "open"), CSN-1.D.1, CSN-1.D.2, CSN-1.D.3</div>
        <div class="vocabBig">: <strong>Internet</strong>, <strong>Computernetzwerk</strong>, <strong>Computersystem</strong>, <strong>Computerger&auml;t</strong> und <strong>World Wide Web</strong>
            <ul>
                <li>
                    Das <strong>Internet</strong> ist ein <em>Computernetzwerk</em>, das offene Protokolle verwendet, um Kommunikation zu standardisieren. Um auf das Internet zugreifen zu k&ouml;nnen, brauchst du ein <em>Computerger&auml;t</em>, das mit dem Internet verbunden ist.
                    <ul>
                        <div class="commentBig">CSN-1.A.1, CSN-1.A.2, CSN-1.A.3, CSN-1.A.4, CSN-1.B.1, CSN-1.B.2, CSN-1.D.1, CSN-1.D.3</div>
                        <li>Ein <strong>Computer<em>netzwerk</em></strong> ist ein verbundenes <em>Computersystem</em>, das Daten senden oder empfangen kann.</li>
                        <li>Ein <strong>Computer<em>system</em></strong> ist eine Gruppe von <em>Computerger&auml;ten</em> und Programmen, die gemeinsam ein Ziel verfolgen.</li>
                        <li>Ein <strong>Computer<em>ger&auml;t</em></strong> ist ein physisches Objekt, das ein Programm ausf&uuml;hren kann, etwa Computer, Tablets, Mobiltelefone oder intelligente Sensoren.</li>
                    </ul>
                </li>
                <li>Das <strong>World Wide Web</strong> ist ein System verkn&uuml;pfter Seiten, Programme und Dateien, das das Internet nutzt.</li>
            </ul>
        </div>
        <p>Viele Menschen verwenden &bdquo;Internet&ldquo; und &bdquo;World Wide Web&ldquo; synonym, aber das stimmt nicht. Das <em>Internet</em> ist ein Netzwerk unabh&auml;ngiger, aber miteinander verbundener Computerger&auml;te auf der ganzen Welt. Das <em>World Wide Web</em> ist die Sammlung verkn&uuml;pfter Webseiten, die du dir in einem Browser ansehen kannst, indem du eine Adresse wie <a href="https://snap.berkeley.edu/snap/snap.html" target="_blank" title="https://snap.berkeley.edu/snap/snap.html">https://snap.berkeley.edu/snap/snap.html</a> eingibst. Die meisten Webseiten sind in HTML (HyperText Markup Language) geschrieben und werden von deinem Browser mit HTTP (HyperText Transfer Protocol) interpretiert.</p>
        <p>Das Internet ist allgemeiner als das World Wide Web. Es unterst&uuml;tzt auch E-Mails, mobile Apps, Textnachrichten (SMS oder Short Message Service), Dateitransfers und viele weitere Formen der computerbasierten Kommunikation.</p>

        <div class="forYouToDo">
			<ol>
				<div class="ap-standard">CSN-1.D (in #1)</div>
                <li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.png" alt="Sprich mit deiner Partnerin oder deinem Partner" title="Sprich mit deiner Partnerin oder deinem Partner" /><img class="inline" src="/bjc-r/img/icons/write-out-thoughts.png" alt="Schreibe deine Gedanken auf" title="Schreibe deine Gedanken auf" /><br />Was ist der Unterschied zwischen dem Internet und dem World Wide Web?</li>
			</ol>
		</div>
        <div class="ap-standard">IOC-1.B.1</div>
        <p>Das World Wide Web ist weit &uuml;ber seine urspr&uuml;ngliche Bestimmung hinausgewachsen, n&auml;mlich den schnellen und einfachen Austausch von Informationen innerhalb der wissenschaftlichen Gemeinschaft. Die Erweiterung des Webs um Dinge wie Online-Shopping und pers&ouml;nliche Blogs war eine <em>nicht beabsichtigte Folge</em> der Technologie.</p>

        <div class="ap-standard">CSN-1.B.1 ("open" part), CSN-1.E.1</div>
        <img class="imageRight" src="/bjc-r/img/4-internet/redundant-2.jpg" height="250px" alt="Diagramm eines Netzwerks mit einem Absender und einem Empf&auml;nger an den Endpunkten sowie vielen Verbindungen zwischen zahlreichen Knoten" title="Diagramm eines Netzwerks mit vielen redundanten Verbindungen zwischen Absender und Empf&auml;nger" />
        <h3>Wie funktioniert das Internet?</h3>
        <p>
            Das Internet ist ein riesiges Netzwerk von Computern, das Kommunikation rund um den Globus erm&ouml;glicht. Es funktioniert, weil es fehlertolerant konstruiert ist (es kann weiterarbeiten, auch wenn Teile des Netzwerks ausfallen) und weil es Protokolle (eine Art Abstraktion) f&uuml;r das Routing und die &Uuml;bertragung von Daten verwendet:
            <ul>
                <li>Das Internet ist fehlertolerant, weil es ein <strong>redundantes Netzwerk</strong> ist. Zwischen den physischen Verbindungen existieren <em>mehrere Pfade</em>, die <em>Redundanz</em> schaffen. Selbst wenn ein Pfad nicht verf&uuml;gbar ist, gibt es noch einen anderen Weg, um eine Nachricht vom Absender zum Empf&auml;nger zu bringen (wie rechts dargestellt). Die Software in den Verbindungspunkten wei&szlig;, wie sie Daten umleiten kann, falls eine Verbindung ausf&auml;llt.</li>
                <li>Daten werden &uuml;ber <strong>offene Protokolle</strong> &uuml;bertragen. Protokolle <em>vereinheitlichen</em> die Kommunikation, sodass alle Daten nach denselben Regeln gesendet und empfangen werden. Diese Protokolle sind <em>offen</em> (frei verf&uuml;gbar), damit alle Systeme entwickelt werden k&ouml;nnen, die sich mit dem Internet verbinden.</li>
            </ul>
    	</p>
        <p>Das Internet ist jedoch nicht einfach nur ein Netzwerk aus Computern. Es ist ein <em>Netzwerk von Netzwerken</em>. Die Verbindungspunkte zwischen Netzwerken nennt man <strong>Router</strong>. Das sind Netzwerkger&auml;te, die den Datenverkehr zwischen Teilnetzen im Internet weiterleiten. Die Auswertung der Informationen findet erst auf dem Zielrechner statt.</p>
        <div class="sidenote"> <small>Bild aus dem <a href="http://jacobsschool.ucsd.edu/news/news_releases/release.sfe?id=685" target="_blank" title="Digital Dandelions: The flowering of network research">UC San Diego Jacobs School of Engineering</a>.</small></div>
		<div class="vocabBig">: <strong>Router</strong> und <strong>ISP</strong>
            <ul>
                <li>Ein <strong>Router</strong> ist ein Computer, der Informationen von einem Netzwerk in ein anderes weiterleitet.</li>
                <p>Dein Computer verbindet sich wahrscheinlich &uuml;ber einen Router irgendwo in deinem Zuhause mit deinem <em>ISP</em>.</p>
                <li><strong>ISPs</strong> (Internet Service Provider) sind Unternehmen, die Haushalten und Institutionen Internetzugang verkaufen.</li>
                <p>Die Computer, die mit dem Internet verbunden sind, und die Verbindungen zwischen ihnen geh&ouml;ren keiner einzelnen Organisation. Unterschiedliche ISPs versorgen verschiedene Gemeinschaften mit dem Internet. Und innerhalb gro&szlig;er Organisationen (zum Beispiel Universit&auml;ten) stellt die Organisation selbst die Internetverbindung bereit.</p>
            </ul>
        </div>
        <div><a href="http://jacobsschool.ucsd.edu/news/news_releases/release.sfe?id=685" target="_blank"><img class="indent noshadow" height="512" src="/bjc-r/img/4-internet/network-of-networks.jpg" alt="Netzwerkdiagramm des Internets, das an eine Pusteblume erinnert" title="Netzwerkdiagramm des Internets der UC San Diego Jacobs School of Engineering" /></a></div>
        <div class="forYouToDo" id="first">
            <ol start="2">
                <img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.png" alt="Sprich mit deiner Partnerin oder deinem Partner" title="Sprich mit deiner Partnerin oder deinem Partner" />
                <li>Warum sieht das Diagramm des Internets in der Mitte wie ein Kn&auml;uel und an den R&auml;ndern wie ein Feuerwerk aus?</li>
				<li>Diskutiert, wie diese Form damit zusammenh&auml;ngt, wie Menschen &uuml;ber einen <em>ISP</em> usw. eine Verbindung zum Internet herstellen. Schreibe eine kurze Beschreibung auf und/oder erkl&auml;re sie jemand anderem.</li>
                <li>
                    <div class="ap-standard">CSN-1.A</div>
                    <img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.png" alt="Sprich mit deiner Partnerin oder deinem Partner" title="Sprich mit deiner Partnerin oder deinem Partner" />
                    <img class="inline" src="/bjc-r/img/icons/write-out-thoughts.png" alt="Schreibe deine Gedanken auf" title="Schreibe deine Gedanken auf" />
                    Beschreibe, wie Computerger&auml;te in einem Netzwerk miteinander verbunden sind.
                </li>
            </ol>
        </div>

        <h3>Was ist die Cloud?</h3>
        <div class="vocabBig">: <strong>Bandbreite</strong> und <strong>die Cloud</strong>
            <ul>
                <div class="commentBig">CSN-1.A.7, CSN-1.A.8</div>
                <li><strong>Bandbreite</strong> ist die maximale Datenmenge, die innerhalb eines festen Zeitraums gesendet werden kann (bei digitalen Daten wird sie in Bits pro Sekunde gemessen). Eine h&ouml;here Bandbreite ist besser, weil die Daten schneller &uuml;bertragen werden.</li>
                <li>Daten in <strong>der Cloud</strong> zu speichern bedeutet, sie <em>irgendwo</em> im Internet abzulegen, ohne dass du den genauen Ort kennst. Der Cloud-Anbieter (Google, Dropbox, Amazon, Snap<em>!</em> usw.) verwaltet den tats&auml;chlichen Speicherort.</li>
            </ul>
        </div>
        <p>In den fr&uuml;hen Tagen des Internets war die <em>Bandbreite</em> gering, sodass Menschen keine Videos versenden konnten (nur Text und kleine Bilder). Damals waren Computer gro&szlig; und teuer, also ging man zu einem Rechenzentrum, um Berechnungen durchzuf&uuml;hren. Als die Technik kleiner und effizienter wurde, verloren diese Zentren an Bedeutung, weil Menschen Berechnungen auf pers&ouml;nlichen Computerger&auml;ten ausf&uuml;hren konnten.</p>
        <p>In j&uuml;ngster Zeit ben&ouml;tigen bestimmte Arten von Berechnungen (etwa Websuchen und Spracherkennung) jedoch wieder viel Rechenleistung, weshalb diese Aufgaben an riesige &bdquo;Computerfarmen&ldquo; ausgelagert werden, in denen Zehntausende Computer gemeinsam an einem Problem arbeiten. Diese Computerfarmen werden zusammenfassend als <em>die Cloud</em> bezeichnet. Du hast die Cloud in diesem Kurs bereits genutzt: Alle deine Snap<em>!</em>-Projekte werden in der Cloud gespeichert. Du benutzt zwar weiterhin deinen Computer vor Ort, doch einige Programme laufen tats&auml;chlich in der Cloud.</p>

		<div class="endnote">Wenn du deine Snap<em>!</em>-Projekte in deinem Konto speicherst, liegen sie nicht auf deinem lokalen Computer, sondern in der Cloud. Deshalb musst du dich anmelden, um darauf zuzugreifen. &Auml;hnlich verh&auml;lt es sich mit Google Drive oder Dropbox: Auch dort werden alle Dateien in der Cloud gespeichert. Und wenn du einen webbasierten E-Mail-Dienst (z.&nbsp;B. Gmail oder Yahoo) nutzt, werden deine E-Mails ebenfalls in der Cloud abgelegt.</div>

        <div class="forYouToDo">
			<ol start="5">
                <li>
                    <!-- Question 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="cloud computing"
                        hasinlinefeedback="true" maxchoices="1" responseIdentifier="ri1" shuffle="true">
                        <div class="prompt">Welche der folgenden Aussagen ist <em><strong>kein</strong></em> Vorteil der Speicherung von Daten mit <em>Cloud Computing</em>?</div>
                        <div class="choice" identifier="c1">
                            <div class="text">Verhindert Datenverlust bei einem Defekt des pers&ouml;nlichen Computers der Nutzerin.</div>
                            <div class="feedback">Das ist ein wichtiger Vorteil von Cloud Computing.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">L&auml;sst sich leicht von der individuellen Nutzung auf die Anwendung in gro&szlig;en Unternehmen skalieren.</div>
                            <div class="feedback">Das ist ein wichtiger Vorteil von Cloud Computing.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Kann umweltfreundlich sein, weil viele Nutzende gro&szlig;e Systeme und Ressourcen effizient gemeinsam verwenden.</div>
                            <div class="feedback">Das ist ein wichtiger potenzieller Vorteil von Cloud Computing.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Verbesserte Sicherheit und Privatsph&auml;re im Vergleich zur Speicherung auf dem pers&ouml;nlichen Computer.</div>
                            <div class="feedback">Richtig. Beim Cloud Computing vertraust du deine Daten jemand anderem an.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c4"></div>
                        </div>
                    </div>
                </li>
			</ol>
		</div>


	</body>
</html>
