<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 6, Labor 1: Hierarchie der Computerabstraktion, Seite 2</title>
	</head>
    <body>
        <h2>Die Software-Dom&auml;ne: Anwendungen</h2>
        <div class="learn"><strong>Auf dieser Seite</strong> erkundest du einige der vielen Zwecke, f&uuml;r die Menschen Softwareanwendungen nutzen.</div>

        <p>
            Anwendungsprogramme (kurz &bdquo;Apps&ldquo;) sind die Programme, mit denen Nutzer*innen direkt interagieren. Einige Einsatzbereiche kennst du bestimmt:
           <ul>
                <li><strong>Kommunikation.</strong> Mit einem Browser rufst du Webseiten im World Wide Web auf. Du bleibst mit Freund*innen &uuml;ber soziale Netzwerke, E-Mail, Textnachrichten und Chats in Kontakt &ndash; als Text, Audio oder Video. Du kannst der Welt au&szlig;erdem in einem Blog (Kurzform f&uuml;r &bdquo;Weblog&ldquo;) oder einem Vlog (Kurzform f&uuml;r &bdquo;Video Blog&ldquo;) mitteilen, was du denkst.</li>
                <li><strong>Audio.</strong> Dein Computer oder Handy hat fast sicher eine App, mit der du Musik abspielst &ndash; entweder aus deiner eigenen Sammlung oder &uuml;ber einen Internetradio-Dienst. Du kannst mit Software auch selbst Musik <em>erstellen</em>, indem du neue Kl&auml;nge mit Synthesizern erzeugst, vorhandene Kl&auml;nge samplest (also wiederverwendest) oder Umgebungsger&auml;usche aufnimmst. Statt dich auf die Musikauswahl anderer zu verlassen, stellt dir Software wie Pandora ein personalisiertes Radioprogramm zusammen.</li>
                <li><strong>Bilder.</strong> Wahrscheinlich hast du eine Fotobetrachter-App auf deinem Computer oder Smartphone. Mit Software kannst du Bilder bearbeiten, Kunstwerke gestalten, die Sch&auml;rfe verbessern oder sogar &bdquo;Fake News&ldquo; erzeugen, indem du nicht zusammengeh&ouml;rige Bilder kombinierst. Wenn du zum Beispiel R&ouml;ntgenaufnahmen machen l&auml;sst, werden die Ergebnisse direkt an die Arztpraxis gemailt, statt auf das Entwickeln der Bilder zu warten.</li>
                <li><strong>Video.</strong> &Uuml;ber Streaming-Dienste schaust du Filme online oder produzierst eigene. Du kannst Videos auf dem Handy drehen, verschiedene Aufnahmen kombinieren, <!--Cartoons eigens daf&uuml;r animieren und--> sie ins Internet hochladen oder auf eine DVD brennen, um sie mit Freund*innen zu teilen. In der Filmindustrie entstehen per Computeranimation Spezialeffekte wie Weltraumwesen, Heere von Soldat*innen oder Superheld*innen, die &uuml;ber Geb&auml;ude springen.</li>
                <li><strong><em>Deine</em> Programme.</strong> Auch die Projekte, die du in Snap<em>!</em> erstellt hast, sind Apps!</li>
            </ul>
        </p>

        <p>
            Es gibt auch Software, die nicht f&uuml;r den pers&ouml;nlichen Gebrauch gedacht ist, sondern in Industrie und Hochschulen zum Einsatz kommt. Anwendungen steuern Raketen, analysieren Versuchsergebnisse oder unterst&uuml;tzen das Design von Geb&auml;uden und Autos. Es gibt sogar Software, die weitere Software schreibt.
			<ul>
    			<li>Die Menge an Informationen im Internet ist riesig. Computer k&ouml;nnen Daten aus unterschiedlichen Quellen verkn&uuml;pfen und so &uuml;berraschende Ergebnisse liefern. Das nennt man <strong>Data Mining</strong>. Unternehmen kombinieren zum Beispiel Standortdaten aus verschiedenen Smartphones, um Staus oder beliebte Restaurants zu erkennen. Oder sie sammeln viele Online-Informationen &uuml;ber dich, um dir Werbung f&uuml;r Produkte zu zeigen, die dich vermutlich interessieren, oder um deine politischen Ansichten f&uuml;r Wahlkampagnen einzuordnen.</li>
                <li>Computer lassen sich darauf trainieren, aus vorhandenen Informationen <em>Generalisierungen</em> abzuleiten, also Muster zu erkennen, mit denen sie Vorhersagen treffen k&ouml;nnen. Das wird <strong>maschinelles Lernen</strong> genannt. Forschende bringen Computern zum Beispiel bei, Teleskopdaten auszuwerten, um Neues &uuml;ber das Universum zu erfahren.</li>
                <li>Mit <strong>Tabellenkalkulationen</strong> verwaltest du Budget, erstellst Diagramme oder Tabellen. Tabellenkalkulationen setzen einen Prozess um, der fr&uuml;her mit Stift und Papier erledigt wurde &ndash; sie sorgten daf&uuml;r, dass Unternehmen Personal Computer ernst nahmen.</li>
            </ul>
        </p>
		<p>Wenn neue Arten von Hardware erfunden werden, entstehen neue wichtige Arten von Software. Das Smartphone beispielsweise, das seine Besitzer*innen immer dabei haben, erm&ouml;glichte Apps wie die Lied-Erkennung: Du h&ouml;rst einen Song, den du magst und noch nicht kennst, h&auml;ltst dein Handy hoch, die App nimmt einen kurzen Ausschnitt auf und findet ihn in einer Datenbank. Weil unsere Telefone fast immer eingeschaltet sind, k&ouml;nnen sie auch kontinuierlich deinen Standort erfassen. Das ist praktisch, wenn du Freund*innen finden willst, die ihre Position mit dir teilen &ndash; aber auch problematisch, wenn dein Arbeitgeber erf&auml;hrt, dass du an einer politischen Demonstration f&uuml;r oder gegen B&uuml;rgerrechte teilgenommen hast.</p>

        <div class="forYouToDo" id="first">
            <ol>
                <li>
                	Liste f&uuml;r jede der folgenden Kategorien drei Programme auf:
                      <ul>
                        <li>Kommunikation</li>
                        <li>Audio</li>
                        <li>Bilder</li>
                        <li>Video</li>
                        <li>Deine Snap<em>!</em>-Projekte</li>
                    </ul>
                </li>
			</ol>
		</div>

        <div class="takeItFurther">
    		<ol type="A">
            	<li>Welche bekannten Komponist*innen nutzen Sampling in ihren Songs?</li>
                <li>Was ist Autotune und welche popul&auml;ren K&uuml;nstler*innen setzen es ein?</li>
                <li>Welche Arten der Fotobearbeitung lassen sich mit Software umsetzen? Welche hast du selbst schon ausprobiert?</li>
			</ol>
		</div>


	</body>
</html>
