<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 3, Labor 5: Informatik in der Arbeitswelt, Seite 2</title>
	</head>

	<body>
    	<h2>Arbeitsbedingungen</h2>
        <div class="todo">
            <p>Neue pinke Box. --MF, 21.12.17</p>
            <p>MF: K&ouml;nnte ein Review/leichte &Uuml;berarbeitung gebrauchen; zwei SI-Labs direkt hintereinander sind anstrengend.</p>
        </div>
        <div class="learn">
            <p><strong>Auf dieser Seite</strong> betrachtest du zwei Arten, wie Technologie die Arbeitswelt ver&auml;ndert.</p>
        </div>

        <p>Computer k&ouml;nnen den <em>Stil</em> der Arbeit ver&auml;ndern, selbst wenn sie den Job nicht ersetzen.</p>

        <div class="forYouToDo" id="first">
        	<ol>
            	<div class="sidenote">Hier einige Ergebnisse einer <a href="http://www.amanet.org/training/articles/the-latest-on-workplace-monitoring-and-surveillance.aspx" target="_blank" title="The Latest on Workplace Monitoring and Surveillance (AMA)">Umfrage zu elektronischer &Uuml;berwachung aus dem Jahr 2007</a>.</div>
            	<li>Arbeitgebende nutzen Technologie auf diese Weise, um Mitarbeitende zu &uuml;berwachen. Welche Vor- und Nachteile haben diese Regeln?
                <ul>
                	<li>Zugang zu bestimmten Websites sperren, z.&nbsp;B. soziale Medien (Facebook, Twitter), Spieleseiten oder andere als unangemessen oder anst&ouml;&szlig;ig eingestufte Seiten.</li>
                    <li>Die E-Mail-Nutzung &uuml;berwachen, einschlie&szlig;lich Mitlesen von Nachrichten.</li>
                    <li>Videos &uuml;berwachen, um Diebstahl zu verhindern.</li>
                </ul>
                </li>
                <li>On-Demand-Gesch&auml;fte gab es schon vor dem Internet, doch Technologie hat die &bdquo;On-Demand-&Ouml;konomie&ldquo; stark wachsen lassen. Viele On-Demand-Unternehmen besch&auml;ftigen keine festen Angestellten, sondern unabh&auml;ngige Auftragnehmende. Das gibt den Arbeitskr&auml;ften gro&szlig;e Flexibilit&auml;t, wann sie arbeiten, kostet sie aber Leistungen wie Krankengeld, Krankenversicherung, Mitbestimmung, Jobsicherheit oder Arbeitslosengeld bei K&uuml;ndigung.
                  <ul>
                	<li>Recherchiere zur On-Demand-&Ouml;konomie. Diese Ressourcen helfen beim Einstieg.
                      <ul>
                    	<!--<li><a href="https://theondemandeconomy.org/participants/" target="_blank" title="The On Demand Economy">Examples of on-demand companies (theondemandeconomy.org)</a></li>-->
                        <li>Ein l&auml;ngerer, aber informativer Artikel: <a href="http://www.businessinsider.com/the-on-demand-economy-is-reshaping-companies-and-careers-2015-1" target="_blank" title="The 'On-Demand Economy' Is Reshaping Companies And Careers (businessinsider.com)">The 'On-Demand Economy' Is Reshaping Companies And Careers (businessinsider.com)</a></li>
                        <li><a href="http://www.wired.com/2015/09/doordash-grubhub-caviar-labor-suits/" target="_blank" title="Even More Labor Complaints Filed against On-Demand Companies (wired.com)">Even More Labor Complaints Filed against On-Demand Companies (wired.com)</a></li>
                        <li>Ein Beispiel daf&uuml;r, wie Uber Fahrende &uuml;berwacht, obwohl sie keine Angestellten sind: <a href="http://www.wired.com/2016/01/uber-using-phone-data-to-track-how-fast-drivers-are-going/" target="_blank" title="Uber Using Phone Data to Track How Fast Drivers are Going (wired.com)">Uber Using Phone Data to Track How Fast Drivers are Going (wired.com)</a></li>
                    </ul>
                    </li>
                    <li>Unten findest du vier Aussagen. Diskutiert und entscheidet, ob ihr zustimmt oder nicht.
                      <ul>
                    	<li>On-Demand-Arbeitende wissen, worauf sie sich einlassen, also sollten sie Unternehmen nicht verklagen, weil sie keine Leistungen bekommen.</li>
                        <li>Im Allgemeinen leisten Menschen bessere Arbeit, wenn sie einem Unternehmen verbunden und loyal sind. Spielt es eine Rolle, wenn jemand sowohl f&uuml;r Uber als auch f&uuml;r Lyft f&auml;hrt?</li>
                        <li>Die On-Demand-&Ouml;konomie sorgt nur daf&uuml;r, dass die Reichen reicher und die Armen &auml;rmer werden.</li>
                        <li>F&uuml;r traditionelle Unternehmen mit Angestellten ist es schwer, mit dem On-Demand-Modell zu konkurrieren.</li>
                    </ul>
                    </li>
                    <li>Denke dir eine Idee f&uuml;r ein On-Demand-Unternehmen aus, das du gr&uuml;nden k&ouml;nntest.</li>
                </ul>
                </li>

            </ol>
        </div>


	</body>
</html>
