<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 2, Labor 5: Urheberrecht, Seite 3</title>
	</head>

	<body>
        <h2>Der gesellschaftliche Kompromiss</h2>
 		<div class="learn">
        	<p><strong>Auf dieser Seite</strong> besch&auml;ftigst du dich mit Aspekten der rechtlichen Geschichte des Urheberrechts.</p>
        </div>

    	<p>So lautet Artikel&nbsp;1, Abschnitt&nbsp;8 der US-Verfassung in Bezug auf Urheberrechte und Patente:</p>
        <div class="takeNote"><big>Der Kongress hat die Befugnis [...] den Fortschritt von Wissenschaft und n&uuml;tzlichen K&uuml;nsten zu f&ouml;rdern, indem er den Autorinnen und Erfinderinnen f&uuml;r begrenzte Zeit das ausschlie&szlig;liche Recht an ihren Schriften und Entdeckungen sichert; [...]</big></div>
        <div class="comment">Du besitzt nicht zwangsl&auml;ufig das Land unter deinem Haus. Jemand anders k&ouml;nnte die Rechte f&uuml;r Bodensch&auml;tze besitzen. --MF, 23.05.19<br />
	Klar, es gibt Ausnahmen. Ein wichtigerer Fall w&auml;re, wenn du zur Miete wohnst! M&uuml;ssen wir diese Nebenfrage wirklich bis ins Juristische ausreizen? -bh</div>
        <p>Achte besonders auf &bdquo;for limited Times&ldquo; (&bdquo;f&uuml;r begrenzte Zeit&ldquo;). Trotz des Wortes &bdquo;Right&ldquo; im Begriff &bdquo;Copyright&ldquo; ist das Urheberrecht kein absolutes Recht wie die Meinungsfreiheit oder das Eigentum an einem Haus inklusive Grundst&uuml;ck. Ein Haus kannst du deinen Kindern, Enkeln usw. vererben. Urheberrechte und Patente gelten nur eine begrenzte Zeit.</p>
        <p>In den letzten Jahrzehnten hat der US-Kongress die Schutzdauer wiederholt verl&auml;ngert. Kritikerinnen bemerken, dass dies oft geschah, kurz bevor <a href="https://de.wikipedia.org/wiki/Steamboat_Willie#Urheberrechtsstatus" target="_blank" title="Steamboat Willie">der erste Mickey-Mouse-Film</a> gemeinfrei geworden w&auml;re. Obwohl alle Beteiligten von Zufall sprechen, gilt die Disney Company inzwischen als Symbol f&uuml;r fragw&uuml;rdige Einflussnahme. Ironischerweise basieren viele Disney-Filme (Schneewittchen, Cinderella usw.) auf Geschichten aus dem Gemeingut, die unter heutiger Rechtslage selbst noch gesch&uuml;tzt w&auml;ren.</p>
        <p>Warum haben die Verfasser der Verfassung Copyright und Patente &uuml;berhaupt aufgenommen? Ihnen ging es um einen <em>Kompromiss</em>: Die Gesellschaft erlaubt Autorinnen und Erfindern, mit ihren Ideen Geld zu verdienen, aber im Gegenzug sollen diese Ideen irgendwann allen geh&ouml;ren und frei nutzbar sein.</p>
   <!--     <p>Protecting the openness of ideas is particularly important for patents. Before there were patents on inventions, inventors used <em>secrecy</em> to protect their ideas, and so the knowledge of how to use the invention often disappeared after the inventor's death.  This has happened repeatedly throughout history; an interesting example is that several colors of paint were unavailable for long periods of time until they were reinvented.  But the most famous example is Antonio Stradivari (1644-1737), an Italian violin maker generally considered to have been the greatest maker of string instruments of all time. Nobody in modern times has been able to create comparable instruments, according to violinists, although blind listening tests seem to show that the musicians can't really tell the difference between a "Strad" and another high-quality violin. Stradivari never published his techniques, but perhaps he would have in return for patent protection, if that had existed in his time. (Today you can buy one of the 500 or so Strads still in existence for about $2 million to $3 million.)</p>
   -->
        <div class="endnote">
        	<p>In Restaurants ist es &uuml;blich, dass beim Servieren einer Geburtstagstorte das Personal &bdquo;Happy Birthday&ldquo; singt. Bis vor Kurzem geschah das <em>illegal</em>: Die Rechte lagen bei Warner/Chappell Music aufgrund eines Liedes mit derselben Melodie von Patty und Mildred Hill aus dem Jahr 1893. Ein Gericht hob den Anspruch 2015 auf, aber Warner k&ouml;nnte noch Berufung einlegen&mdash;das Unternehmen verdiente j&auml;hrlich rund 2&nbsp;Millionen US-Dollar an Lizenzgeb&uuml;hren, vor allem durch Filmproduktionen.</p>
		</div>


	</body>
</html>
