<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 2, Labor 5: Urheberrecht, Seite 4</title>
	</head>

	<body>
        <h2>Urheberrechte und Computer</h2>
        <div class="learn">
            <p><strong>Auf dieser Seite</strong> erf&auml;hrst du, warum Technologie das Anfertigen perfekter Kopien ohne Kosten erm&ouml;glicht und welche Folgen das hat.</p>
        </div>

    	<h3>Einfach kopieren, einfach verbreiten</h3>
        <div class="ap-standard">IOC-1.F.2</div>
        <p>Fr&uuml;her brauchte man ein physisches Medium, um etwas zu kopieren: Papier, Kassette, CD, Videoband, DVD usw. Copyright-Inhaberinnen mussten sich daher kaum Sorgen machen, dass einzelne Personen Kopien f&uuml;r Freundinnen machten. Die Kosten begrenzten die Anzahl der Kopien, und vor dem Computerzeitalter waren Kopien nie perfekt. Rechteinhaberinnen konzentrierten sich auf Kopierfirmen, die massenhaft illegale Kopien verkauften.</p>
        <div class="ap-standard">IOC-1.F.11 bullet 1</div>
        <p>Heute kann jede Person Kopien ins Netz stellen, ohne dass dabei Kosten entstehen, und andere k&ouml;nnen die Inhalte sofort herunterladen oder streamen. Damit sind nun einzelne Nutzerinnen die gr&ouml;&szlig;te Bedrohung, besonders wenn jemand das Material im Internet f&uuml;r viele bereitstellt statt nur ein paar Bekannten zu mailen. Ohne Urheberrecht m&uuml;sste die offizielle Herausgeberin mit Menschen konkurrieren, die das Werk gratis verbreiten.</p>

        <h3>&bdquo;Information wants to be free&ldquo;</h3>
        <div class="ap-standard">IOC-1.F.11 text before bullets</div>
        <p>Dieser Slogan entstand fr&uuml;h im Internet, um gegen das Urheberrecht zu argumentieren. Weil sich alles so leicht kopieren l&auml;sst, so das Argument, seien Einschr&auml;nkungen zum Scheitern verurteilt; Copyright sei &uuml;berholt. Gleichzeitig macht Technologie das Kopieren digitaler Medien quasi kostenlos &ndash; gerade deshalb ist Urheberrecht wichtiger denn je! Fr&uuml;her begrenzten die physischen Kosten die Anzahl der Kopien. Heute sorgt nur noch das Urheberrecht daf&uuml;r, dass K&uuml;nstlerinnen von ihrer Arbeit leben k&ouml;nnen. Das ist sowohl ein rechtliches als auch ein ethisches Thema.</p>

    	<div class="ifTime">
			<ol>
				<li>Suche im Netz nach &bdquo;Information wants to be free&ldquo; und finde Argumente daf&uuml;r und dagegen.</li>
        	</ol>
        </div>

        <div class="forYouToDo">
        	<ol start="2">
                <li>
                    <!-- Frage 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="Imagine Streamshare legal issues" hasinlinefeedback="true" maxchoices="1" responseIdentifier="ri1" shuffle="true">
                        <div class="prompt">
                            <div class="ap-standard">IOC-1.F.11</div>
                            Stell dir eine App namens &bdquo;StreamShare&ldquo; vor, die es erm&ouml;glicht, beliebige digitale Medien (Filme, Musik, E-Books) herunterzuladen und zu teilen. Die App ist beliebt, Kritikerinnen sorgen sich jedoch um die Folgen f&uuml;r Urheberinnen und Verlage. Was ist die gr&ouml;&szlig;te Sorge im Zusammenhang mit Apps wie &bdquo;StreamShare&ldquo;?
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text">Die App k&ouml;nnte den Internetverkehr und damit die Belastung der Provider erh&ouml;hen.</div>
                            <div class="feedback">
                                Das k&ouml;nnte passieren, ist aber nicht das Hauptproblem.
                            </div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">M&ouml;gliche Urheberrechtsverletzungen.</div>
                            <div class="feedback">
                                Richtig! Filesharing-Apps werfen oft Fragen nach unbefugter Verbreitung gesch&uuml;tzter Werke auf.
                            </div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Die App k&ouml;nnte mit ihren eigenen Filesharing-Diensten konkurrieren.</div>
                            <div class="feedback">
                                Wettbewerb ist hier nicht das zentrale juristische Thema.
                            </div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Die App k&ouml;nnte das Teilen unangemessener Inhalte f&ouml;rdern.</div>
                            <div class="feedback">
                                Auch das kann vorkommen, ist aber nicht die prim&auml;re rechtliche Sorge.
                            </div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                          <div class="correctResponse" identifier="c2"></div>
                        </div>
                    </div>
                </li>
            </ol>
        </div>
        
	</body>
</html>
