<!DOCTYPE html>
<html lang="de">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Einheit 2, Labor 5: Urheberrecht, Seite 5</title>
	</head>

	<body>
        <h2>Software als Urheberrechtsschutz</h2>
        <div class="learn">
        	<p><strong>Auf dieser Seite</strong> erf&auml;hrst du, wie Verschl&uuml;sselung eingesetzt wird, um Urheberrechte technisch durchzusetzen.</p>
        </div>

        <h3>Digital Rights Management (DRM)</h3>
        <div class="ap-standard">IOC-1.F.3</div>
        <p>Computer und Internet erm&ouml;glichen den freien Austausch von Medien, k&ouml;nnen aber auch das Gegenteil bewirken. Viele digitale Inhalte werden verschl&uuml;sselt verbreitet. Wer sie kauft, braucht eine Software zum Entschl&uuml;sseln &ndash; und die tut das nur unter bestimmten Bedingungen, die die Herausgeberin festlegt. Vielleicht l&auml;sst sich eine Datei nur auf einem bestimmten Ger&auml;t abspielen. Vielleicht darf es keine zwei Exemplare mit derselben Seriennummer geben. Vielleicht l&auml;uft die Datei an einem bestimmten Datum ab und kann danach nie wieder verwendet werden.</p>
        <p>Digital Rights Management (DRM) stellt den gesellschaftlichen Kompromiss des Urheberrechts auf den Kopf: Eigentlich soll ein Werk irgendwann gemeinfrei werden und frei kopiert werden k&ouml;nnen. DRM verschafft Verlagen beides &ndash; den klassischen Urheberrechtsschutz in den ersten Jahren <em>und</em> eine Kontrolle der Inhalte f&uuml;r immer.</p>

        <h3>Der Digital Millennium Copyright Act</h3>
        <p>Der Digital Millennium Copyright Act (DMCA) ist ein US-Gesetz von 1998. Er macht es strafbar, Methoden zum Umgehen von DRM zu entwickeln, unabh&auml;ngig davon, ob tats&auml;chlich ein Urheberrecht verletzt wird. Gleichzeitig sch&uuml;tzt er Internetanbieter und Plattformen vor Haftung, wenn Nutzerinnen urheberrechtlich gesch&uuml;tztes Material hochladen (z.&nbsp;B. Videos auf YouTube), solange die Plattform nach Hinweis das Material entfernt. Glaubt die hochladende Person, dass kein Versto&szlig; vorliegt, muss sie das beweisen.</p>
        <div class="endnote">
            <a href="#hint-exemptions" data-toggle="collapse" title="Gibt es Ausnahmen vom DMCA?">Gibt es Ausnahmen?</a>
            <div id="hint-exemptions" class="collapse">Der Library of Congress kann zeitlich begrenzte Ausnahmen vom Anti-Umgehungs-Paragrafen des DMCA erlassen (jeweils f&uuml;r drei Jahre), was &uuml;berraschend ist, da die Bibliothek zuvor nicht f&uuml;r Urheberrechtsfragen zust&auml;ndig war. Jede Ausnahme muss nach drei Jahren erneuert werden. Meist geht es um technische Kompatibilit&auml;t (Ger&auml;te verschiedener Hersteller). 2010 sorgte es f&uuml;r Aufsehen, als das &bdquo;Jailbreaken&ldquo; von Smartphones erlaubt wurde.</div>
        </div>
        <p>
            Zwei Beispiele, wie Hersteller den DMCA auf kreative Weise nutzen &ndash; vielleicht anders gedacht, als es die Urheberrechtsgesetze vorsahen:
            <ul>
                <li><strong>Druckerpatronen:</strong> Druckerhersteller verdienen wenig am Verkauf der Ger&auml;te; Konkurrenz dr&uuml;ckt den Preis. Gewinne entstehen bei den austauschbaren Patronen, da Verbraucherinnen auf kompatible Produkte angewiesen sind. Lexmark entwickelte eine Technik, nach der Drucker nur Patronen mit einer Lexmark-Digitalsignatur akzeptieren. Ein anderes Unternehmen rekonstruierte das System und bot eigene Patronen an. Lexmark klagte mit Verweis auf den DMCA, da das zweite Unternehmen das kleine Programm f&uuml;r die Signatur kopiert habe. Lexmark verlor: Das Gericht sah darin keinen legitimen Einsatz des DMCA.</li>
                <li><strong>DVD-Regioncodes:</strong> Auf DVD-H&uuml;llen steht oft, dass sie nur f&uuml;r bestimmte Regionen lizenziert sind. Diese Einschr&auml;nkung erzwingt DRM; der DVD-Player erkennt seine Region. Ziel ist, Filme in &auml;rmeren L&auml;ndern g&uuml;nstig und in reicheren teurer zu verkaufen. Ohne Regioncode k&ouml;nnten Leute Filme billig importieren und weiterverkaufen. Regioncodes dienen ebenfalls, um Fassungen an lokale Zensur anzupassen. Auch dieses System st&uuml;tzt sich auf den DMCA.
                    <div class="endnote">
                        <a href="#hint-free-trade" data-toggle="collapse" title="Verst&ouml;&szlig;t das nicht gegen Freihandel?">Verst&ouml;&szlig;t das nicht gegen Freihandel?</a>
                        <div id="hint-free-trade" class="collapse">Es gab Argumente, Regioncodes verstie&szlig;en gegen Freihandelsabkommen, die Exportbeschr&auml;nkungen untersagen. Es w&auml;re ein Versto&szlig;, wenn die US-Regierung das System erfunden h&auml;tte. Da es jedoch von privaten Unternehmen stammt, ist die Frage offen. Da der DMCA indirekt die Regioncodes absichert, sehen manche darin dennoch einen Vertragsbruch.</div>
                    </div>
                </li>
            </ul>
        </p>

        <div class="forYouToDo" id="first">
            <ol>
                <li>Menschen in &auml;rmeren L&auml;ndern haben deutlich weniger Zugang zu Technik. Recherchiere den Begriff &bdquo;Digital Divide&ldquo; (digitale Kluft). Tr&auml;gt die DVD- (bzw. Blu-Ray-)Regioncodierung zu diesem Problem bei?</li>
            </ol>
        </div>

    </body>
</html>
